venu-madhav-anyam/STM32/14_HAL_Systic_Timer/Src/main.c
#include "stm32l4xx_hal.h"

#define LED_PORT GPIOA
#define LED_PIN  GPIO_PIN_5

void pa5_led_init(void);

const uint32_t MSIRangeTable[] = { 100000, 200000, 400000, 800000, 1000000,
		2000000, 4000000, 8000000, 16000000, 24000000, 32000000, 48000000 };

GPIO_InitTypeDef GPIO_A_InitStruct = { 0 };

void Error_Handler(void) {
	__disable_irq();
	while (1) {
	}
}

void SystemClock_Config(void) {
	RCC_OscInitTypeDef osc = { 0 };
	RCC_ClkInitTypeDef clk = { 0 };

	osc.OscillatorType = RCC_OSCILLATORTYPE_MSI;
	osc.MSIState = RCC_MSI_ON;
	osc.MSIClockRange = RCC_MSIRANGE_6; // 4 MHz
	osc.PLL.PLLState = RCC_PLL_NONE;

	HAL_RCC_OscConfig(&osc);

	clk.ClockType = RCC_CLOCKTYPE_SYSCLK |
	RCC_CLOCKTYPE_HCLK |
	RCC_CLOCKTYPE_PCLK1 |
	RCC_CLOCKTYPE_PCLK2;

	clk.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
	clk.AHBCLKDivider = RCC_SYSCLK_DIV1;
	clk.APB1CLKDivider = RCC_HCLK_DIV1;
	clk.APB2CLKDivider = RCC_HCLK_DIV1;

	HAL_RCC_ClockConfig(&clk, FLASH_LATENCY_0);
}

int main(void) {
	HAL_Init();
	SystemClock_Config();
	pa5_led_init();

	uint32_t lastTick = 0;

	while (1) {

		if (HAL_GetTick() - lastTick >= 1000) {
			HAL_GPIO_TogglePin(LED_PORT, LED_PIN);
			lastTick = HAL_GetTick();
		}

	}
}

void pa5_led_init(void) {
	__HAL_RCC_GPIOA_CLK_ENABLE();

	GPIO_A_InitStruct.Pin = LED_PIN;
	GPIO_A_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_A_InitStruct.Pull = GPIO_NOPULL;
	GPIO_A_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

	HAL_GPIO_Init(GPIOA, &GPIO_A_InitStruct);
}

void SysTick_Handler(void) {
	HAL_IncTick();
}
